In [1]:
# Types of object in python

In [2]:
type(2.67)
type("RS for life")
type(2.00)
type(2)

int

In [3]:
type(3/6)
type(-7/4.8)

float

In [4]:
# Converting from one object type to a different object type

In [9]:
int(2.6) 
float(2)
str(2)
int(5/9)

0

In [10]:
str(2.8)
#int("2 and 1") # >> no
str(2.09)

'2.09'

In [16]:
type(False)
int(False)
int(True)
bool(1)
bool(0)
str(True)

'True'

In [35]:
type(6/6) #> Float
type(6//6) # Int

int

In [38]:
(43 + 42 + 57)/60

2.3666666666666667

In [ ]:
# Strings operations

In [34]:
Name= "Micheal Jackson"
print(Name)
print(Name[0])
print(Name.upper())
print(Name.lower())
print(Name.index("Jack"))
print(Name.index("son"))
print(Name.startswith("M"))
Name.split()
type(Name)
str(Name)
print(Name +' is a pop star')

Micheal Jackson
M
MICHEAL JACKSON
micheal jackson
8
12
True
Micheal Jackson is a pop star

In [44]:
# Silcing
Name[1:3]
Name[:-1]
Name[-2:]
len(Name)
Name[::2] ## Get every second element. 
Name[0:7:2] # Always starts from 0, Get every second element in the range from index 0 to index 6

'Mcel'

In [47]:
str(Name)
type(Name)

str

In [78]:
# Concatenate Strings
Name *3

'Micheal JacksonMicheal JacksonMicheal Jackson'

In [48]:
Fam = "Sousou is the best"
Fam
print("Sousou is the best")
print("Sousou is \nthe best")
print("Sousou is \tthe best")
print("Sousou is \\ the best")

Sousou is the best
Sousou is
the best
Sousou is 	the best
Sousou is \ the best

In [49]:
# String Operations
print("After Upper:",Fam.upper())
print(Fam.replace("Sousou", "Blue"))
Fam.find("is") # return the index

After Upper: SOUSOU IS THE BEST
Blue is the best

7

# Lists

In [54]:
L = ["Michael Jackson", 10.1, 1982]
print(type(L))
print(type(L[0]))
print(type(L[-1]))
print(type(L[-2]))

<class 'list'>
<class 'str'>
<class 'int'>
<class 'float'>

In [59]:
L = ["Michael Jackson", 10.1,1982,"MJ",1]
L
L.extend([2, "Blue"]) # Use extend to add elements to list
L
L.append([3, "Souosu"]) # Use append to add elements to list
print(L)
print(type(L[-1]))

['Michael Jackson', 10.1, 1982, 'MJ', 1, 2, 'Blue', [3, 'Souosu']]
<class 'list'>

In [60]:
L[-1] = [2,"Sun"] # Change the element based on the index
L
del(L[-2])# Delete the element based on the index
print(L)
L[-1]

['Michael Jackson', 10.1, 1982, 'MJ', 1, 2, [2, 'Sun']]

[2, 'Sun']

In [66]:
o= "YOO,budy"
print(type(o))
o.split('_')
o.replace("budy", "man")

<class 'str'>

'YOO,man'

In [ ]:
# Copy and Clone List

In [67]:
o
p=o
p
print("p:",p[:3])
print("o:",o[:4])

p: YOO
o: YOO,

In [187]:
# sort a list
vowels = ['e', 'a', 'u', 'o', 'i']
vowels.sort()
print(vowels)
vowels.sort(reverse=True)
print(vowels)

['a', 'e', 'i', 'o', 'u']
['u', 'o', 'i', 'e', 'a']

In [224]:
vowels
new_vowles=[]
for i in vowels:
    vowels2= i.replace("e","kokou")
    new_vowles.append(vowels2)
print(new_vowles)

['u', 'o', 'i', 'kokou', 'a']

In [73]:
ok = ['name', 'sousou', 'blue', '0']

In [74]:
ok = ['name', 'sousou', 'blue', '0']
pop = []

for i in ok:
    updated = i.replace('name', 'sky')
    pop.append(updated)
print(pop)

['sky', 'sousou', 'blue', '0']

In [75]:
strings = ["a", "ab", "aa", "c"]

new_strings = []

for string in strings:
    new_string = string.replace("a", "1")
    new_strings.append(new_string)
print(new_strings)

['1', '1b', '11', 'c']

# Tuples

In [81]:
tul=(2,"CHO", 3.9)
type(tul)
type(tul[-1])
type(tul[-2])
tul2= ("MAN", 1.09)
tul+tul2
len(tul+tul2)

5

In [82]:
Ratings = (0, 9, 6, 5, 10, 8, 9, 6, 2)
Ratings
print("Desending order:", sorted(Ratings, reverse=True))
print("Ascending order:",sorted(Ratings))

Desending order: [10, 9, 9, 8, 6, 6, 5, 2, 0]
Ascending order: [0, 2, 5, 6, 6, 8, 9, 9, 10]

In [205]:
k=(1,3, "woo", (3,"wh"), [1,"lol"], ("boby", "dor", "milk"))
print(type(k[-1]))
print(type(k[-2]))
print(k[-1][-1][-1])

<class 'tuple'>
<class 'list'>
k

In [83]:
genres_tuple = ("pop", "rock", "soul", "hard rock", "soft rock", \
                "R&B", "progressive rock", "disco") 
genres_tuple
for i in genres_tuple:
    print (i, end= " ")
len(genres_tuple)

pop rock soul hard rock soft rock R&B progressive rock disco

8

In [90]:
genres_tuple
for i in genres_tuple:
    print(i, end=" ")
new_genre=[]
##
for ir in genres_tuple:
    tuple2=ir.replace("soft rock", "kiki bro")
    new_genre.append(tuple2)
new_genre
new_list= list(new_genre)
ok = ['name', 'sousou', 'blue', '0']

pop rock soul hard rock soft rock R&B progressive rock disco

# Dictionaries in Python

In [92]:
release_year_dict = {"Thriller": "1982", "Back in Black": "1980", \
                    "The Dark Side of the Moon": "1973", "The Bodyguard": "1992", \
                    "Bat Out of Hell": "1977", "Their Greatest Hits (1971-1975)": "1976", \
                    "Saturday Night Fever": "1977", "Rumours": "1977"}

In [93]:
ages = {"sousou":13, "Blue":10}
print(ages.keys())
print(ages.values())

dict_keys(['sousou', 'Blue'])
dict_values([13, 10])

In [94]:
ages["SUNNY"]= 12  # we aded another key
print(ages)
ages.keys

{'sousou': 13, 'Blue': 10, 'SUNNY': 12}

In [95]:
del(ages["SUNNY"]) #deleat a key

In [98]:
ages
for i in ages:
    print(i)  

print("SUSOU" in ages)
print("sousou" in ages)

sousou
Blue
False
True

In [102]:
Dict={"A":1,"B":"2","C":[3,3,3],"D":(4,4,4),'E':5,'F':6}
len(Dict)
type(Dict["D"])

tuple

In [107]:
Dict["D"] = [2,"HOHO", "LOL"]
print(Dict)
print(type(Dict["D"]))
print(type(Dict["D"][0]))

{'A': 1, 'B': '2', 'C': [3, 3, 3], 'D': [2, 'HOHO', 'LOL'], 'E': 5, 'F': 6}
<class 'list'>
<class 'int'>

In [280]:
type(Dict["D"])

list

# conditions

In [109]:
age = 18
age = 19

if age > 18:
    print("you can enter" )
elif age== 18:
    print("go to see pink floyd")
else:
    print("go see Meat Loaf" )
    
print("move on")

you can enter
move on

In [110]:
# logical operator
# Condition statement example
album_year = 1980
if(album_year > 1979) and (album_year < 1990):
    print ("Album year was in between 1980 and 1989")
print("")
print("Do Stuff..")

Album year was in between 1980 and 1989

Do Stuff..

In [111]:
# Condition statement example
album_year = 1983
if not (album_year == '1984'):
    print ("Album year is not 1984")

Album year is not 1984

# Loops

In [113]:
t= (5)
range(t)
for i in range(t):
    print(i, end="")
for i in range(t):
    print(i)

012340
1
2
3
4

In [115]:
dates = [1982,1980,1973]
N = len(dates)
print(N)
for i in range(N):
    print(dates[i])

3
1982
1980
1973

In [119]:
for i in dates:
    print(dates)
print("")
for i in range(len(dates)):
    print(i,dates[i])
print("")
for i in range(len(dates)):
    print(dates[i])

[1982, 1980, 1973]
[1982, 1980, 1973]
[1982, 1980, 1973]

0 1982
1 1980
2 1973

1982
1980
1973

In [300]:
squares = ['red', 'yellow', 'green', 'purple', 'blue']
for i in range(len(squares)):
    print("Before square ", i, 'is',  squares[i])

Before square  0 is red
Before square  1 is yellow
Before square  2 is green
Before square  3 is purple
Before square  4 is blue

In [120]:
grocery = ['bread', 'milk', 'butter']
for i in range(len(grocery)):
    print(i, grocery[i])
print("")
for i, gro in enumerate(grocery):
    print(i, gro)

0 bread
1 milk
2 butter

0 bread
1 milk
2 butter

In [122]:
# While Loop Example
dates = [1982, 1980, 1973, 2000]
i =0
year=0
while(year!=1973):
    year = dates[i]
    i=i+1
    print(year)
print("it took", i, "to get out of the loop")

print("")
p=0
year2=dates[0]
while(year2>1973):
    year2=dates[p]
    p=p+1
    print(year2)

1982
1980
1973
it took 3 to get out of the loop

1982
1980
1973

In [124]:
for i in range(len(dates)):
    print(i,dates[i])
print("")
for i in dates:
    print(i)

0 1982
1 1980
2 1973
3 2000

1982
1980
1973
2000

In [31]:
squares = ['orange', 'orange', 'purple', 'blue ', 'orange']
new_squares = []
i = 0
while(squares[i] == 'orange'):
    new_squares.append(squares[i])
    i = i + 1
print (new_squares)

['orange', 'orange']

# Classes and Objects in Python

In [ ]:
# check IBM course

In [33]:
x=1

if(x!=1):
    print('Hello')
else:
    print('Hi')
print('Mike')

Hi
Mike

In [41]:
A=['1','2','3']
for a in A:
    print(2*a)
A.sort()
A

11
22
33

['1', '2', '3']

# Reading files with open

In [42]:
!wget -O /resources/data/Example1.txt https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/labs/example1.txt

'wget' is not recognized as an internal or external command,
operable program or batch file.

In [ ]:
# Open file using with
example1 = "/resources/data/Example1.txt"
with open(example1, "r") as file1:
    FileContent = file1.read()
    print(FileContent)

In [ ]:
# Verify if the file is closed
file1.closed

# Loadind data with pandas

In [129]:
import pandas as pd

In [130]:
songs = {"name": ["Kik all day", "hello", "angle", "tomato sauce", "angle"],
        "released date":[1990, 1998, 2020, 2010, 2017],
        "length": ["70:30", "55:55", "45:48", "80:34", "67:90"]}
print(type(songs))
print(songs["name"])
print(songs.keys())
songs.values()

<class 'dict'>
['Kik all day', 'hello', 'angle', 'tomato sauce', 'angle']
dict_keys(['name', 'released date', 'length'])

dict_values([['Kik all day', 'hello', 'angle', 'tomato sauce', 'angle'], [1990, 1998, 2020, 2010, 2017], ['70:30', '55:55', '45:48', '80:34', '67:90']])

In [131]:
df_songs=pd.DataFrame(songs)
df_songs
df_songs[["name"]]
df_songs[["length"]]
df_songs[["name", "length"]] #specify the col to retrieve

           name length
0   Kik all day  70:30
1         hello  55:55
2         angle  45:48
3  tomato sauce  80:34
4         angle  67:90

In [134]:
# Indexing in pandas
# Index-based selection
df_songs.name
print(df_songs["name"][1])
df_songs

hello

           name  released date length
0   Kik all day           1990  70:30
1         hello           1998  55:55
2         angle           2020  45:48
3  tomato sauce           2010  80:34
4         angle           2017  67:90

In [153]:
print(df_songs.head(2))
df_songs.iloc[0] #select the first row

          name  released date length
0  Kik all day           1990  70:30
1        hello           1998  55:55

name             Kik all day
released date           1990
length                 70:30
Name: 0, dtype: object

In [175]:
df_songs.iloc[:, 1] # retrieve the second column
df_songs.iloc[:, 1]
df_songs[["name"]]
df_songs["length"]
df_songs.iloc[:, 2] # retrieve the third col
df_songs.iloc[[0,3], 2] # retrieve the 3 col (1 row and 4 row)

0    70:30
3    80:34
Name: length, dtype: object

In [189]:
df_songs.iloc[0:3] # retrieve the first three rows 
df_songs.iloc[0:3,2] # retrieve the first three rows of the third column

0    70:30
1    55:55
2    45:48
Name: length, dtype: object

In [80]:
print(df_songs.iloc[0:2])
df_songs.iloc[-1:] # selec the last elemnts of the data

          name  released date length
0  Kik all day           1990  70:30
1        hello           1998  55:55

           name  released date length
3  tomato sauce           2010  80:34

In [196]:
print(df_songs)
df_songs.iloc[1] 
df_songs.iloc[0:2]
df_songs.iloc[0:4]
df_songs.iloc[:, 1]
#df_songs.iloc[[0,3], 1]
#df_songs.iloc[:, [0, 2]]
#df_songs.iloc[:, [0,2]]

           name  released date length
0   Kik all day           1990  70:30
1         hello           1998  55:55
2         angle           2020  45:48
3  tomato sauce           2010  80:34
4         angle           2017  67:90

0    1990
1    1998
2    2020
3    2010
4    2017
Name: released date, dtype: int64

In [ ]:
# Label-based selection

In [202]:
df_songs.iloc[0:2, 2] # the first two rows for the 3rd column

0    70:30
1    55:55
Name: length, dtype: object

In [204]:
df_songs.loc[:, ["name", "length"]].iloc[-1:] # first retrive the col by callin gghe names then retrieving the last element

    name length
4  angle  67:90

In [218]:
print(df_songs)
df_songs.loc[:, ["name"]].iloc[1:] #retieve the column :"name" then all elemnets from the second rows onworad

           name  released date length
0   Kik all day           1990  70:30
1         hello           1998  55:55
2         angle           2020  45:48
3  tomato sauce           2010  80:34
4         angle           2017  67:90

           name
1         hello
2         angle
3  tomato sauce
4         angle

In [237]:
df_songs.loc[:, ["name"]].iloc[[0,4],] # select only certain rows

          name
0  Kik all day
4        angle

In [ ]:
# Conditional selection

In [219]:
df_songs[["name"]]
df_songs.loc[:, ["name"]]
df_songs.name == "angle"

0    False
1    False
2     True
3    False
4     True
Name: name, dtype: bool

In [220]:
df_songs.name == "angle"

0    False
1    False
2     True
3    False
4     True
Name: name, dtype: bool

In [221]:
df_songs.loc[df_songs.name == "angle"] # select the data with the condition

    name  released date length
2  angle           2020  45:48
4  angle           2017  67:90

In [228]:
df_songs.loc[(df_songs.name== "angle") & (df_songs.releaseddate == 2020)]

AttributeError: 'DataFrame' object has no attribute 'releaseddate'

In [168]:
df_songs.loc[(df_songs.name == "angle") & (df_songs.length == "67:90")]

    name  released date length
4  angle           2017  67:90

In [174]:
# isin buit in 
df_songs.loc[(df_songs.name.isin(["angle"])) & (df_songs.length == "67:90")]

    name  released date length
4  angle           2017  67:90

In [230]:
# working with missing values
import numpy as np
songs2 = {"name": ["Kik all day", "hello", "angle", "tomato sauce", "angle"],
        "released_date":[1990, 1998, 2020, 2010, np.nan],
        "length": ["70:30", "55:55", "45:48", "80:34", "67:90"]}
songs2
df_songs2 = pd.DataFrame(songs2)
df_songs2

           name  released_date length
0   Kik all day         1990.0  70:30
1         hello         1998.0  55:55
2         angle         2020.0  45:48
3  tomato sauce         2010.0  80:34
4         angle            NaN  67:90

In [240]:
df_songs2.loc[:, ["released_date", "length"]].iloc[[0,4], ] # retrieving the targeted col then the selected rows
df_songs2.loc[df_songs2.released_date.notnull()] #retreing all the date while excuding the NaN values
df_songs2.loc[(df_songs2.name == ("angle")) & df_songs2.released_date.notnull()]
df_songs2.loc[(df_songs2.name.isin(["angle"]))& df_songs2.released_date.notnull()] # the two scripts are the same : use .isin()

    name  released_date length
2  angle         2020.0  45:48

In [535]:
df_songs2.loc[:, ["name", "released_date"]]
df_songs2.loc[(df_songs2.released_date.notnull() & (df_songs2.released_date <= 2010))]

           name  released_date length
0   Kik all day         1990.0  70:30
1         hello         1998.0  55:55
3  tomato sauce         2010.0  80:34

In [242]:
df_songs2.loc[df_songs2.name.isin(["angle"])] # select the data that matches "angle" in the col of names
df_songs.loc[df_songs2.name == "angle"] # they are bassicallly the same

    name  released date length
2  angle           2020  45:48
4  angle           2017  67:90

In [243]:
df_songs2.loc[df_songs2.name.isin(["angle"])&(df_songs2.released_date.notnull())] # 2 cond + get rid of the data with NaN

    name  released_date length
2  angle         2020.0  45:48

In [244]:
df_songs2["new"]="lol"

In [245]:
df_songs2

           name  released_date length  new
0   Kik all day         1990.0  70:30  lol
1         hello         1998.0  55:55  lol
2         angle         2020.0  45:48  lol
3  tomato sauce         2010.0  80:34  lol
4         angle            NaN  67:90  lol

In [219]:
#df_songs2.drop(["new"],axis = 1, inplace = True)

In [250]:
df_songs2["new"]= "hi bro"
df_songs2
df_songs2.loc[(df_songs2.name.isin(["angle"]))& (df_songs2.released_date.notnull())]
df_songs2.rename(columns={'new':'random'})

           name  released_date length  random
0   Kik all day         1990.0  70:30  hi bro
1         hello         1998.0  55:55  hi bro
2         angle         2020.0  45:48  hi bro
3  tomato sauce         2010.0  80:34  hi bro
4         angle            NaN  67:90  hi bro

In [258]:
df_songs2.iloc[[0,2],[0, 1]]
df_songs2.loc[:, ["name", "released_date"]].iloc[[0, 2], ]

          name  released_date
0  Kik all day         1990.0
2        angle         2020.0

In [245]:
df_songs2.loc[df_songs2.name =="angle"]
df_songs2.loc[df_songs.name.isin(["angle"])]
df_songs2.loc[(df_songs.name.isin(["angle"])) & (df_songs2.released_date.notnull())]

    name  released_date length     new
2  angle         2020.0  45:48  hi bro

In [26]:
df_songs2.shape # check the dimesnsion of the data frame
df_songs2.dtypes # check the types of th object within the data frame

name              object
released_date    float64
length            object
new               object
dtype: object

In [252]:
df_songs2["new"]= "CIA"

           name  released_date length  new
0   Kik all day         1990.0  70:30  CIA
1         hello         1998.0  55:55  CIA
2         angle         2020.0  45:48  CIA
3  tomato sauce         2010.0  80:34  CIA
4         angle            NaN  67:90  CIA

In [254]:
#df_songs2.drop("new", axis=1) >> how to deleat an column

           name  released_date length
0   Kik all day         1990.0  70:30
1         hello         1998.0  55:55
2         angle         2020.0  45:48
3  tomato sauce         2010.0  80:34
4         angle            NaN  67:90

In [269]:
#### Proactices
df_songs2
df_songs.iloc[[0,2], ] # select the 1 and 3 rows
df_songs2.loc[:, ["name", "length"]] # select the name and length column
df_songs2.loc[:, ["name", "length"]].iloc[[0, 3], ] # select the name and length column + select the 1 and 4 row
df_songs2.loc[df_songs2["name"]=="angle"] # select the data set where the the elemngt within name col equal to angle
df_songs2.loc[df_songs2.name.isin(["angle"])]
df_songs2.loc[(df_songs2.name.isin(["angle"])) & (df_songs2.released_date.notnull())]

    name  released_date length  new
2  angle         2020.0  45:48  CIA

In [285]:
df_songs2.loc[:, ["released_date"]].iloc[[0,4], ]#selec the col released date and and last column

   released_date
0         1990.0
4            NaN

# summary-functions-and-maps

In [259]:
df_songs2["rating"]= [9, 7, 8, 4, 5] # we added another col

In [263]:
df_songs2
df_songs2.rating.describe()
df_songs2.rating.mean()
df_songs2.rating.max()

9

In [264]:
df_songs2

           name  released_date length     new  rating
0   Kik all day         1990.0  70:30  hi bro       9
1         hello         1998.0  55:55  hi bro       7
2         angle         2020.0  45:48  hi bro       8
3  tomato sauce         2010.0  80:34  hi bro       4
4         angle            NaN  67:90  hi bro       5

In [266]:
# To see a list of unique value
df_songs2.name.unique()
# To see a list of unique values and how often they occur in the dataset
df_songs2.name.value_counts()

angle           2
hello           1
Kik all day     1
tomato sauce    1
Name: name, dtype: int64

In [267]:
df_songs2.name+"__"+df_songs2.length

0     Kik all day__70:30
1           hello__55:55
2           angle__45:48
3    tomato sauce__80:34
4           angle__67:90
dtype: object

In [ ]:
# data frame apply

In [268]:
df.apply(np.sum,axis=0)

NameError: name 'df' is not defined

In [272]:
df_songs2.rating.apply(np.sqrt)

0    3.000000
1    2.645751
2    2.828427
3    2.000000
4    2.236068
Name: rating, dtype: float64

In [274]:
df_songs2.loc[:, ["rating"]].apply(np.sum)

rating    33
dtype: int64

In [341]:
df = pd.DataFrame([[9, 25]] * 3, columns=['P', 'Q'])
df

   P   Q
0  9  25
1  9  25
2  9  25

In [343]:
df.apply(lambda p: pd.Series([1, 2], index=['f1', 'b1']), axis=1)

   f1  b1
0   1   2
1   1   2
2   1   2

In [344]:
df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')

   P  Q
0  1  2
1  1  2
2  1  2

# grouping-and-sorting

In [275]:
df_songs2
df_songs2.groupby("name").name.count()

name
Kik all day     1
angle           2
hello           1
tomato sauce    1
Name: name, dtype: int64

In [276]:
df_songs2.name.value_counts()

angle           2
hello           1
Kik all day     1
tomato sauce    1
Name: name, dtype: int64

In [278]:
df_songs2.groupby("name").max()
df_songs2.groupby("name").min()

              released_date length     new  rating
name
Kik all day          1990.0  70:30  hi bro       9
angle                2020.0  45:48  hi bro       5
hello                1998.0  55:55  hi bro       7
tomato sauce         2010.0  80:34  hi bro       4

In [42]:
df_songs2.groupby("name").rating.min()

name
Kik all day     9
angle           5
hello           7
tomato sauce    4
Name: rating, dtype: int64

In [279]:
df_songs2.groupby("name").rating.agg([min, max, len])

              min  max  len
name
Kik all day     9    9    1
angle           5    8    2
hello           7    7    1
tomato sauce    4    4    1

In [280]:
d = pd.DataFrame({'Animal': ['Eagle', 'Eagle',
                              'Sparrow','Sparrow'],
                   'Max_Speed': [350., 320., 26., 30.]})
d

    Animal  Max_Speed
0    Eagle      350.0
1    Eagle      320.0
2  Sparrow       26.0
3  Sparrow       30.0

In [282]:
d.groupby("Animal").max()
d.groupby("Animal").min()
#d2=d.groupby("Animal").Max_Speed.agg([min, max, len])
#d2

         Max_Speed
Animal
Eagle        320.0
Sparrow       26.0

In [409]:
d3 = d2.index
d3
type(d3)

pandas.core.indexes.base.Index

In [423]:
d.groupby("Animal").Max_Speed.agg([min, max, len]).sort_values(by=["min"], ascending=False)
d.groupby("Animal").Max_Speed.agg([min, max, len]).sort_values(by=["min"], ascending=True)

           min    max  len
Animal
Sparrow   26.0   30.0  2.0
Eagle    320.0  350.0  2.0

In [546]:
df_songs2
df_songs2.groupby(["name"]).rating.agg([min, max, len]).sort_values(by= ["max"], ascending=False)

              min  max  len
name
Kik all day     9    9    1
angle           5    8    2
hello           7    7    1
tomato sauce    4    4    1

In [44]:
df_songs2.loc[df_songs2.rating >=7].sort_values(by=(["rating"]), ascending=False)

          name  released_date length     new  rating
0  Kik all day         1990.0  70:30  hi bro       9
2        angle         2020.0  45:48  hi bro       8
1        hello         1998.0  55:55  hi bro       7

In [437]:
df_songs2.loc[df_songs2.released_date.notnull()].sort_values(by=(["rating"]), ascending=True)

           name  released_date length  new  rating
3  tomato sauce         2010.0  80:34  CIA       4
1         hello         1998.0  55:55  CIA       7
2         angle         2020.0  45:48  CIA       8
0   Kik all day         1990.0  70:30  CIA       9

In [45]:
df_songs2.groupby(["name"]).max().sort_values(["rating"], ascending=False)

              released_date length     new  rating
name
Kik all day          1990.0  70:30  hi bro       9
angle                2020.0  67:90  hi bro       8
hello                1998.0  55:55  hi bro       7
tomato sauce         2010.0  80:34  hi bro       4

In [46]:
df_songs2.loc[df_songs2.released_date.notnull()]

           name  released_date length     new  rating
0   Kik all day         1990.0  70:30  hi bro       9
1         hello         1998.0  55:55  hi bro       7
2         angle         2020.0  45:48  hi bro       8
3  tomato sauce         2010.0  80:34  hi bro       4

# missing values

In [465]:
# retrieve the data with only NaN values
df_songs2[pd.isnull(df_songs2.released_date)] 
#retrive the data with NO NaN in it
df_songs2.loc[df_songs2.released_date.notnull()].sort_values(by=["rating"], ascending=True)

           name  released_date length  new  rating
3  tomato sauce         2010.0  80:34  CIA       4
1         hello         1998.0  55:55  CIA       7
2         angle         2020.0  45:48  CIA       8
0   Kik all day         1990.0  70:30  CIA       9

# Renaming & Combining

In [283]:
# chnage the column names 
r=df_songs2.rename(columns={"rating":"rate"})

In [284]:
r

           name  released_date length     new  rate
0   Kik all day         1990.0  70:30  hi bro     9
1         hello         1998.0  55:55  hi bro     7
2         angle         2020.0  45:48  hi bro     8
3  tomato sauce         2010.0  80:34  hi bro     4
4         angle            NaN  67:90  hi bro     5

In [285]:
# you can also change the index names 
df_songs2.rename(index={0: "first_row", 1: "second_row"})

                    name  released_date length     new  rating
first_row    Kik all day         1990.0  70:30  hi bro       9
second_row         hello         1998.0  55:55  hi bro       7
2                  angle         2020.0  45:48  hi bro       8
3           tomato sauce         2010.0  80:34  hi bro       4
4                  angle            NaN  67:90  hi bro       5

In [286]:
# combining folowing the str order of the rows index 
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                  index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                  index=[4, 5, 6, 7])

In [287]:
df1
df2
pd.concat([df1, df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [288]:
# combining regeardless of the rows's indices
df3 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']}
                  )

df4 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']})

In [289]:
so=pd.concat([df3, df4])
so

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [290]:
so.iloc[[0,7], ] # notice that the indices are miss up because the initial data frame did not included indices when combining

    A   B   C   D
0  A0  B0  C0  D0
3  A7  B7  C7  D7

In [291]:
df_songs2

           name  released_date length     new  rating
0   Kik all day         1990.0  70:30  hi bro       9
1         hello         1998.0  55:55  hi bro       7
2         angle         2020.0  45:48  hi bro       8
3  tomato sauce         2010.0  80:34  hi bro       4
4         angle            NaN  67:90  hi bro       5

In [302]:
df_songs2.loc[df_songs2.released_date.notnull()].sort_values(by=["rating"], ascending=True)
df_songs2.groupby(["name"]).name.count()
df_songs2.name.value_counts()

angle           2
hello           1
Kik all day     1
tomato sauce    1
Name: name, dtype: int64

In [303]:
df_songs2.rename(columns={"rating": "rate", "new":"old"})

           name  released_date length     old  rate
0   Kik all day         1990.0  70:30  hi bro     9
1         hello         1998.0  55:55  hi bro     7
2         angle         2020.0  45:48  hi bro     8
3  tomato sauce         2010.0  80:34  hi bro     4
4         angle            NaN  67:90  hi bro     5

In [304]:
df_songs2[pd.isnull(df_songs2.released_date)]

    name  released_date length     new  rating
4  angle            NaN  67:90  hi bro       5

In [306]:
df_songs2.loc[(df_songs2.name=="angle") & (df_songs2.released_date.notnull())]

    name  released_date length     new  rating
2  angle         2020.0  45:48  hi bro       8